 /*
3. Имеется таблица денежных переводов transfers.
from – номер аккаунта, с которого сделан перевод,
to – номер аккаунта, на который сделан перевод,
amount – сумма перевода,
tdate – дата перевода.
Требуется создать оператор выбора, который для каждого аккаунта выведет периоды постоянства остатков.
Результат запроса должен содержать столбцы acc – номер аккаунта, dt_from - начало периода,
dt_to - конец периода, balance – остаток на счёте в данном периоде.
Дата конца последнего периода – 01.01.3000.

*/

-- Извините, но как бы я ни напрягал свой мозг и как бы много вкладок в браузере я ни открыл, но так и не смог выполнить 3ю задачу. :(